export const validations = {
  name: /^[A-Z]/,
  lastName: /^[A-Z]/,
  dateOfBirth: /^\s*(3[01]|[12][0-9]|0?[1-9])\.(1[012]|0?[1-9])\.((?:19|20)\d{2})\s*$/,
  phone: /^\d{1}-\d{4}-\d{2}-\d{2}$/,
  website: /https:\/\//,
  desc: /^.{1,600}$/,
  techStack: /^.{1,600}$/,
  projectDesc: /^.{1,600}$/,
}

export const errors = {
  empty: "Поле пустое. Заполните пожалуйста",
  name: "Имя должно начинаться с заглавной буквы",
  lastName: "Фамилия должна начинаться с заглавной буквы",
  dateOfBirth: "Введите настоящую дату рождения в формате ДД.ММ.ГГГГ",
  phone: "Введите телефон в формате 7-7777-77-77",
  website: "Сайт должен начинаться с https://",
  desc: "Превышен лимит символов в поле",
  techStack: "Превышен лимит символов в поле",
  projectDesc: "Превышен лимит символов в поле",
}